# CannotModifyLinkedFile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures..::..CannotModifyLinkedFile Property
BuiltInFailures..::..LinkFailures Class See Also
---
Shared Sites in the link ""%1!s!"" cannot be modified.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotModifyLinkedFile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotModifyLinkedFile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotModifyLinkedFile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LinkFailures Class
Autodesk.Revit.DB Namespace